import React from 'react';
import Gimg from "../../Images/Userimg.png"
import user1 from "../../Images/user1.png"
import user2 from "../../Images/user2.png"
import user3 from "../../Images/user3.png"
import user4 from "../../Images/user4.png"

function User(props) {
    return (
        <div className='user'>
            <div className="container">
                <div className="user_start">
                    <div className="user_img">
                        <div className="user-Gimg">
                            <img src={Gimg} alt="img"/>
                        </div>
                        <div className="user_imgs">
                            <img src={user1} alt="img"/>
                            <img src={user2} alt="img"/>
                            <img src={user3} alt="img"/>
                            <img src={user4} alt="img"/>
                        </div>
                    </div>
                    <div className="user_about">
                        <div className="user_about-name">
                            <span>Виктор 22</span>
                            <button>Поприветствовать <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_17_3869)">
                                    <path d="M2.70076 5.08167C3.22298 4.71667 4.0102 4.78667 4.47909 5.17389L3.94132 4.39222C3.50854 3.775 3.66354 3.10722 4.28132 2.67389C4.89909 2.24222 6.64965 3.40278 6.64965 3.40278C6.21298 2.77944 6.29465 1.98944 6.91798 1.55222C7.54132 1.11667 8.40132 1.26722 8.83798 1.89167L14.6269 10.0694L13.8891 17.2222L7.73187 14.9767L2.36132 7.01389C1.92076 6.38667 2.07298 5.52167 2.70076 5.08167Z" fill="#EF9645"/>
                                    <path d="M1.49742 9.63111C1.49742 9.63111 0.868532 8.71444 1.78575 8.08611C2.70187 7.45778 3.3302 8.37389 3.3302 8.37389L6.24742 12.6283C6.34798 12.4606 6.45798 12.295 6.58075 12.1317L2.53187 6.22778C2.53187 6.22778 1.90353 5.31166 2.8202 4.68333C3.73631 4.055 4.36464 4.97111 4.36464 4.97111L8.17298 10.525C8.31464 10.4094 8.45964 10.2933 8.60909 10.1794L4.19409 3.74C4.19409 3.74 3.56575 2.82389 4.48242 2.19555C5.39853 1.56722 6.02687 2.48333 6.02687 2.48333L10.4419 8.92166C10.6041 8.82222 10.7646 8.73611 10.9258 8.645L6.79909 2.62722C6.79909 2.62722 6.17075 1.71111 7.08687 1.08278C8.00298 0.454442 8.63131 1.37055 8.63131 1.37055L12.9946 7.73389L13.658 8.70166C10.9091 10.5872 10.6474 14.1344 12.218 16.425C12.5319 16.8833 12.9902 16.5694 12.9902 16.5694C11.1052 13.82 11.6808 10.7306 14.4302 8.84555L13.6196 4.78889C13.6196 4.78889 13.3169 3.72 14.3852 3.41666C15.4541 3.11389 15.7574 4.18278 15.7574 4.18278L16.6935 6.96278C17.0646 8.065 17.4596 9.16333 17.9824 10.2022C19.4585 13.1356 18.5769 16.7811 15.7935 18.6906C12.7574 20.7722 8.60687 19.9983 6.52464 16.9628L1.49742 9.63111Z" fill="#FFDC5D"/>
                                    <path d="M6.66678 17.8011C4.44456 17.8011 2.199 15.5556 2.199 13.3333C2.199 13.0261 1.974 12.7778 1.66678 12.7778C1.35956 12.7778 1.08789 13.0261 1.08789 13.3333C1.08789 16.6667 3.33345 18.9122 6.66678 18.9122C6.974 18.9122 7.22233 18.6406 7.22233 18.3333C7.22233 18.0261 6.974 17.8011 6.66678 17.8011Z" fill="#5DADEC"/>
                                    <path d="M3.88889 18.8889C2.22222 18.8889 1.11111 17.7778 1.11111 16.1111C1.11111 15.8039 0.862778 15.5556 0.555556 15.5556C0.248333 15.5556 0 15.8039 0 16.1111C0 18.3333 1.66667 20 3.88889 20C4.19611 20 4.44444 19.7517 4.44444 19.4444C4.44444 19.1372 4.19611 18.8889 3.88889 18.8889ZM13.3333 1.11111C13.0267 1.11111 12.7778 1.36 12.7778 1.66667C12.7778 1.97333 13.0267 2.22222 13.3333 2.22222C15.5556 2.22222 17.7778 4.21611 17.7778 6.66667C17.7778 6.97333 18.0267 7.22222 18.3333 7.22222C18.64 7.22222 18.8889 6.97333 18.8889 6.66667C18.8889 3.60333 16.6667 1.11111 13.3333 1.11111Z" fill="#5DADEC"/>
                                    <path d="M16.1112 0.0233307C15.8046 0.0233307 15.5557 0.248886 15.5557 0.555553C15.5557 0.862219 15.8046 1.13444 16.1112 1.13444C17.7779 1.13444 18.8657 2.37055 18.8657 3.88889C18.8657 4.19555 19.1373 4.44444 19.4446 4.44444C19.7518 4.44444 19.9768 4.19555 19.9768 3.88889C19.9768 1.75722 18.3334 0.0233307 16.1112 0.0233307Z" fill="#5DADEC"/>
                                </g>
                                <defs>
                                    <clipPath id="clip0_17_3869">
                                        <rect width="20" height="20" fill="white"/>
                                    </clipPath>
                                </defs>
                            </svg>
                            </button>
                        </div>

                        <div className="user_about-your">
                            <div className="user_info-height user_display">
                                <p>Рост</p>
                                <span>186 см</span>
                            </div>
                            <div className="user_info-weight user_display">
                                <p>Вес</p>
                                <span>80 кг</span>
                            </div>
                            <div className="user_info-eyes user_display">
                                <p>Цвет глаз</p>
                                <span>Голубые</span>
                            </div>
                            <div className="user_info-hair user_display">
                                <p>Цвет волос</p>
                                <span>Светлые</span>
                            </div>
                            <div className="user_info-goal user_display">
                                <p>Цель знакомства</p>
                                <span>Пока не знаю</span>
                            </div>

                        </div>

                        <div className="user_info-about">
                            <h4>О себе</h4>
                            <p>Задача организации, в особенности же сложившаяся структура организации представляет собой интересный эксперимент проверки модели развития.
                                Задача организации, в особенности же постоянный количественный рост и сфера нашей активности играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач.</p>
                        </div>

                        <span className="user_data">На сайте с 21.08.2021</span>
                    </div>
                </div>
            </div>
            <div className="user_mobile">
                <div className="user-mobile-img">
                    <img src={Gimg} alt="img"/>
                </div>
            </div>
        </div>

    );
}

export default User;